hurrican/hurrican-acceptance-test/src/citrus/resources/templates/resourceorder/v1/Resource_Order_Management/ffmCreateOrder.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <createOrder xmlns="http://www.mnet.de/esb/cdm/Resource/WorkforceService/v1">
            <order>
                <id>@ignore@</id>
                <displayId>@ignore@</displayId>
                <customerOrderId>${lineId}</customerOrderId>
                <description>
                    <summary>Wholesale FTTX</summary>
                    <details>@ignore@</details>
                    <techParams>
                        <common>
                            <lineId>${lineId}</lineId>
                            <contractId>@ignore@</contractId>
                        </common>
                        <dialUpAccessVoIP>
                            <password>voice</password>
                        </dialUpAccessVoIP>
                        <technicalService>
                            <tsType>DOWNSTREAM</tsType>
                            <tsName>50000 kbit/s</tsName>
                        </technicalService>
                        <technicalService>
                            <tsType>ONL_IP_DEFAULT</tsType>
                            <tsName>dynamische IPv6</tsName>
                        </technicalService>
                        <technicalService>
                            <tsType>UPSTREAM</tsType>
                            <tsName>10000 kbit/s</tsName>
                        </technicalService>
                        <technicalService>
                            <tsType>KOMBI</tsType>
                            <tsName>50/10_VOIP_IPv6</tsName>
                        </technicalService>
                        <site>
                            <type>Endstelle_B</type>
                            <location>
                                <street>Columbusstr.</street>
                                <houseNumber>8</houseNumber>
                                <city>Langenmosen</city>
                                <zipCode>86571</zipCode>
                            </location>
                            <device>
                                <manufacturer>@ignore@</manufacturer>
                            </device>
                            <HVT>@ignore@</HVT>
                            <downstream>50000</downstream>
                            <upstream>10000</upstream>
                            <lastValidDSLAMProfile>MD_50000_10000_H</lastValidDSLAMProfile>
                            <wiringData>
                                <type>EQ-In</type>
                                <deviceName>@ignore@</deviceName>
                                <moduleType>@ignore@</moduleType>
                                <physicType>FTTB_VDSL2</physicType>
                                <HWEQN>@ignore@</HWEQN>
                            </wiringData>
                        </site>
                    </techParams>
                </description>
                <type>Wholesale FTTX</type>
                <activityType>BSA_Neu_MK_FttB</activityType>
                <activitySubtype>Neuschaltung</activitySubtype>
                <contactPerson>
                    <role>HOTLINE_PARTNER</role>
                    <firstName>Herbert</firstName>
                    <lastName>Auftragsmann</lastName>
                    <communication>
                        <phone>891324567</phone>
                        <mobile>1791234567</mobile>
                        <email>test@test.com</email>
                    </communication>
                </contactPerson>
                <contactPerson>
                    <role>TECH_SERVICE</role>
                    <firstName>Franz</firstName>
                    <lastName>Technikmann</lastName>
                    <communication>
                        <phone>891324567</phone>
                        <mobile>1791234567</mobile>
                        <email>Techniktest@test.com</email>
                    </communication>
                </contactPerson>
                <contactPerson>
                    <role>KUNDE</role>
                    <firstName>Heinz</firstName>
                    <lastName>Endkundinsky</lastName>
                    <communication>
                        <phone>891324567</phone>
                        <mobile>1791234567</mobile>
                        <email>Endkundetest@test.com</email>
                    </communication>
                </contactPerson>
                <contactPerson>
                    <role>Endkunde Montageleistung</role>
                    <firstName>Heinz</firstName>
                    <lastName>Endkundinsky</lastName>
                    <communication>
                        <phone>891324567</phone>
                        <mobile>1791234567</mobile>
                        <email>Endkundetest@test.com</email>
                    </communication>
                </contactPerson>
                <contactPerson>
                    <role>Kunde</role>
                    <firstName>Heinz</firstName>
                    <lastName>Endkundinsky</lastName>
                    <communication>
                        <phone>891324567</phone>
                        <mobile>1791234567</mobile>
                        <email>Endkundetest@test.com</email>
                    </communication>
                </contactPerson>
                <qualification>Endkundenservice FTTB</qualification>
                <qualification>Endkundenservice Wholesale</qualification>
                <location>
                    <street>Columbusstr.</street>
                    <houseNumber>8</houseNumber>
                    <zipCode>86571</zipCode>
                    <city>Langenmosen</city>
                </location>
                <requestedTimeSlot>
                    <earliestStart>@startsWith(${executionDate})@</earliestStart>
                    <latestStart>@ignore@</latestStart>
                    <latestEnd>@ignore@</latestEnd>
                </requestedTimeSlot>
                <plannedDuration>@ignore@</plannedDuration>
            </order>
        </createOrder>
    </soap:Body>
</soap:Envelope>
